book_collection/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Harry Potter"], ["created_at", "2022-02-04 01:26:01.684693"], ["updated_at", "2022-02-04 01:26:01.684693"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = $1, "publishDate" = $2 WHERE "books"."id" = $3  [["updated_at", "2022-02-04 03:20:55.834593"], ["publishDate", "1999-10-01"], ["id", 28]]

	def delete
		@book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]