app/controllers/book_checkouts_controller.rb

  def index
    @book_checkouts = BookCheckout.all
---
SELECT "book_checkouts".* FROM "book_checkouts"

  def new
    @book_checkout = BookCheckout.new
		@books = Book.all
		@users = User.all
---
SELECT "books".* FROM "books"
SELECT "users".* FROM "users"

  def create
    @book_checkout = BookCheckout.new(book_checkout_params)

    respond_to do |format|
      if @book_checkout.save
---
INSERT INTO "book_checkouts" ("user_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["book_id", 2], ["created_at", "2022-02-14 05:39:50.701215"], ["updated_at", "2022-02-14 05:39:50.701215"]]

    def set_book_checkout
      @book_checkout = BookCheckout.find(params[:id])
---
SELECT "book_checkouts".* FROM "book_checkouts" WHERE "book_checkouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]